RIET/src/InformationRegisters/AdditionalDataOfItemsInTemporaryImpExp/AdditionalDataOfItemsInTemporaryImpExp.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AdditionalDataOfItemsInTemporaryImpExp</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </resources>
  <resources>
    <name>CustomsRegime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </resources>
  <resources>
    <name>CCAJobReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ShipperName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/AdditionalDataOfItemsInTemporaryImpExp/RecordSetModule.bsl
Процедура ДобавитьЗапись(Период, Item, ProcessLevel, Regime, CCAJobReference=Неопределено, ShipperName=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ВызватьИсключение "Период is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Item) Тогда
		ВызватьИсключение "Item is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ProcessLevel) Тогда
		ВызватьИсключение "Process level is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Regime) Тогда
		ВызватьИсключение "Regime is empty!";
	КонецЕсли;
	
	Движение = Добавить();
	Движение.Период = Период;
	Движение.Item = Item;
	Движение.ProcessLevel = ProcessLevel;
	Движение.CustomsRegime = Regime;
	Движение.CCAJobReference = CCAJobReference;
	Движение.ShipperName = ShipperName;
	
КонецПроцедуры
